In [1]:
pip install pyspark

Collecting pyspark
  Downloading pyspark-3.5.2.tar.gz (317.3 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 317.3/317.3 MB 4.6 MB/s eta 0:00:00
  Preparing metadata (setup.py) ... done
Requirement already satisfied: py4j==0.10.9.7 in /usr/local/lib/python3.10/dist-packages (from pyspark) (0.10.9.7)
Building wheels for collected packages: pyspark
  Building wheel for pyspark (setup.py) ... done
  Created wheel for pyspark: filename=pyspark-3.5.2-py2.py3-none-any.whl size=317812365 sha256=45732f628cba148d4422d8368d5b24ea284841299ffc04706390ac8e882e3b2e
  Stored in directory: /root/.cache/pip/wheels/34/34/bd/03944534c44b677cd5859f248090daa9fb27b3c8f8e5f49574
Successfully built pyspark
Installing collected packages: pyspark
Successfully installed pyspark-3.5.2

In [2]:
#Create Sample Data

from pyspark.sql import SparkSession
from pyspark.sql.functions import lit
from datetime import datetime

In [3]:
# Initialize Spark session
spark = SparkSession.builder.appName("PySparkSQLFunctions").getOrCreate()

In [4]:
spark

In [5]:
# Sample Data
data = [
    (1, "John Doe", "2024-08-01", 23, 1000.50),
    (2, "Jane Smith", "2024-08-02", 34, 2000.75),
    (3, "Jake White", "2024-08-03", 18, 3000.10),
    (4, "Jill Black", "2024-08-04", 45, 4000.25),
    (5, "James Brown", "2024-08-05", 29, 1500.30),
    (6, "Madhav Mishra", "2024-08-06", 31, 2500.45),

]

In [6]:
# Create DataFrame
columns = ["id", "name", "dob", "age", "salary"]
df = spark.createDataFrame(data, columns)

# Show the initial DataFrame
df.show()

+---+-------------+----------+---+-------+
| id|         name|       dob|age| salary|
+---+-------------+----------+---+-------+
|  1|     John Doe|2024-08-01| 23| 1000.5|
|  2|   Jane Smith|2024-08-02| 34|2000.75|
|  3|   Jake White|2024-08-03| 18| 3000.1|
|  4|   Jill Black|2024-08-04| 45|4000.25|
|  5|  James Brown|2024-08-05| 29| 1500.3|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|
+---+-------------+----------+---+-------+

In [7]:
#col
#Selects the "name" column.

from pyspark.sql.functions import col

df.select(col("name")).show()

+-------------+
|         name|
+-------------+
|     John Doe|
|   Jane Smith|
|   Jake White|
|   Jill Black|
|  James Brown|
|Madhav Mishra|
+-------------+

In [8]:
#lit
#Adds a new column with a literal value.

df_country = df.withColumn("country", lit("USA"))
df_country.show()

+---+-------------+----------+---+-------+-------+
| id|         name|       dob|age| salary|country|
+---+-------------+----------+---+-------+-------+
|  1|     John Doe|2024-08-01| 23| 1000.5|    USA|
|  2|   Jane Smith|2024-08-02| 34|2000.75|    USA|
|  3|   Jake White|2024-08-03| 18| 3000.1|    USA|
|  4|   Jill Black|2024-08-04| 45|4000.25|    USA|
|  5|  James Brown|2024-08-05| 29| 1500.3|    USA|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|    USA|
+---+-------------+----------+---+-------+-------+

In [9]:
df.show()
#df.show()

+---+-------------+----------+---+-------+
| id|         name|       dob|age| salary|
+---+-------------+----------+---+-------+
|  1|     John Doe|2024-08-01| 23| 1000.5|
|  2|   Jane Smith|2024-08-02| 34|2000.75|
|  3|   Jake White|2024-08-03| 18| 3000.1|
|  4|   Jill Black|2024-08-04| 45|4000.25|
|  5|  James Brown|2024-08-05| 29| 1500.3|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|
+---+-------------+----------+---+-------+

In [10]:
#expr
#Adds 5 to the "age" column.

from pyspark.sql.functions import expr

df_age = df.withColumn("age_plus_5", expr("age + 5"))
df_age.show()

+---+-------------+----------+---+-------+----------+
| id|         name|       dob|age| salary|age_plus_5|
+---+-------------+----------+---+-------+----------+
|  1|     John Doe|2024-08-01| 23| 1000.5|        28|
|  2|   Jane Smith|2024-08-02| 34|2000.75|        39|
|  3|   Jake White|2024-08-03| 18| 3000.1|        23|
|  4|   Jill Black|2024-08-04| 45|4000.25|        50|
|  5|  James Brown|2024-08-05| 29| 1500.3|        34|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|        36|
+---+-------------+----------+---+-------+----------+

In [11]:
#when
#Classifies people as "Adult" or "Minor".

from pyspark.sql.functions import when

df_classification = df.withColumn("classification", when(col("age") >= 18, "Adult").otherwise("Minor"))
df_classification.show()

#from pyspark.sql.functions import when

#df.withColumn("status", when(col("age") > 18, "Adult").otherwise("Minor")).show()

+---+-------------+----------+---+-------+--------------+
| id|         name|       dob|age| salary|classification|
+---+-------------+----------+---+-------+--------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|         Adult|
|  2|   Jane Smith|2024-08-02| 34|2000.75|         Adult|
|  3|   Jake White|2024-08-03| 18| 3000.1|         Adult|
|  4|   Jill Black|2024-08-04| 45|4000.25|         Adult|
|  5|  James Brown|2024-08-05| 29| 1500.3|         Adult|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|         Adult|
+---+-------------+----------+---+-------+--------------+

In [12]:
#concat
#Concatenates first and last names with a space.

from pyspark.sql.functions import concat

df_concat = df.withColumn("full_name", concat(col("name"), lit(" ")))

df_concat.show()

+---+-------------+----------+---+-------+--------------+
| id|         name|       dob|age| salary|     full_name|
+---+-------------+----------+---+-------+--------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|     John Doe |
|  2|   Jane Smith|2024-08-02| 34|2000.75|   Jane Smith |
|  3|   Jake White|2024-08-03| 18| 3000.1|   Jake White |
|  4|   Jill Black|2024-08-04| 45|4000.25|   Jill Black |
|  5|  James Brown|2024-08-05| 29| 1500.3|  James Brown |
|  6|Madhav Mishra|2024-08-06| 31|2500.45|Madhav Mishra |
+---+-------------+----------+---+-------+--------------+

In [13]:
#substring
#Extracts the first three characters from the "name" column.

from pyspark.sql.functions import substring

df_substring = df.withColumn("first_three_chars", substring(col("name"), 1, 3))
df_substring.show()

+---+-------------+----------+---+-------+-----------------+
| id|         name|       dob|age| salary|first_three_chars|
+---+-------------+----------+---+-------+-----------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|              Joh|
|  2|   Jane Smith|2024-08-02| 34|2000.75|              Jan|
|  3|   Jake White|2024-08-03| 18| 3000.1|              Jak|
|  4|   Jill Black|2024-08-04| 45|4000.25|              Jil|
|  5|  James Brown|2024-08-05| 29| 1500.3|              Jam|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|              Mad|
+---+-------------+----------+---+-------+-----------------+

In [14]:
#split
#Splits the "name" column into an array of words.

from pyspark.sql.functions import split

df_split = df.withColumn("name_array", split(col("name"), " "))
df_split.show()

+---+-------------+----------+---+-------+----------------+
| id|         name|       dob|age| salary|      name_array|
+---+-------------+----------+---+-------+----------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|     [John, Doe]|
|  2|   Jane Smith|2024-08-02| 34|2000.75|   [Jane, Smith]|
|  3|   Jake White|2024-08-03| 18| 3000.1|   [Jake, White]|
|  4|   Jill Black|2024-08-04| 45|4000.25|   [Jill, Black]|
|  5|  James Brown|2024-08-05| 29| 1500.3|  [James, Brown]|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|[Madhav, Mishra]|
+---+-------------+----------+---+-------+----------------+

In [15]:
#regexp_replace
#Replaces "John" with "Jon" in the "name" column.

from pyspark.sql.functions import regexp_replace

df_replace = df.withColumn("replaced_name", regexp_replace(col("name"), "John", "Jon"))
df_replace.show()

+---+-------------+----------+---+-------+-------------+
| id|         name|       dob|age| salary|replaced_name|
+---+-------------+----------+---+-------+-------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|      Jon Doe|
|  2|   Jane Smith|2024-08-02| 34|2000.75|   Jane Smith|
|  3|   Jake White|2024-08-03| 18| 3000.1|   Jake White|
|  4|   Jill Black|2024-08-04| 45|4000.25|   Jill Black|
|  5|  James Brown|2024-08-05| 29| 1500.3|  James Brown|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|Madhav Mishra|
+---+-------------+----------+---+-------+-------------+

In [16]:
#count
#Counts the number of records in the DataFrame.

from pyspark.sql.functions import count

df_count = df.agg(count("*").alias("total_count"))
df_count.show()

+-----------+
|total_count|
+-----------+
|          6|
+-----------+

In [17]:
#sum
#Calculates the total salary.

from pyspark.sql.functions import sum

df_sum = df.agg(sum("salary").alias("total_salary"))
df_sum.show()

+------------+
|total_salary|
+------------+
|    14002.35|
+------------+

In [18]:
#avg
#Calculates the average age.

from pyspark.sql.functions import avg

df_avg = df.agg(avg("age").alias("average_age"))
df_avg.show()

+-----------+
|average_age|
+-----------+
|       30.0|
+-----------+

In [19]:
#max
#Finds the maximum salary.

from pyspark.sql.functions import max

df_max = df.agg(max("salary").alias("max_salary"))
df_max.show()

+----------+
|max_salary|
+----------+
|   4000.25|
+----------+

In [20]:
#min
#Finds the minimum age.

from pyspark.sql.functions import min

df_min = df.agg(min("age").alias("min_age"))
df_min.show()

+-------+
|min_age|
+-------+
|     18|
+-------+

In [21]:
#round
#Rounds the salary to the nearest integer.

from pyspark.sql.functions import round

df_round = df.withColumn("rounded_salary", round(col("salary"), 0))
df_round.show()

+---+-------------+----------+---+-------+--------------+
| id|         name|       dob|age| salary|rounded_salary|
+---+-------------+----------+---+-------+--------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|        1001.0|
|  2|   Jane Smith|2024-08-02| 34|2000.75|        2001.0|
|  3|   Jake White|2024-08-03| 18| 3000.1|        3000.0|
|  4|   Jill Black|2024-08-04| 45|4000.25|        4000.0|
|  5|  James Brown|2024-08-05| 29| 1500.3|        1500.0|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|        2500.0|
+---+-------------+----------+---+-------+--------------+

In [22]:
#date_format
#Formats the "dob" (date of birth) column as MM/dd/yyyy.

from pyspark.sql.functions import date_format

df_date_format = df.withColumn("formatted_dob", date_format(col("dob"), "MM/dd/yyyy"))
df_date_format.show()

+---+-------------+----------+---+-------+-------------+
| id|         name|       dob|age| salary|formatted_dob|
+---+-------------+----------+---+-------+-------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|   08/01/2024|
|  2|   Jane Smith|2024-08-02| 34|2000.75|   08/02/2024|
|  3|   Jake White|2024-08-03| 18| 3000.1|   08/03/2024|
|  4|   Jill Black|2024-08-04| 45|4000.25|   08/04/2024|
|  5|  James Brown|2024-08-05| 29| 1500.3|   08/05/2024|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|   08/06/2024|
+---+-------------+----------+---+-------+-------------+

In [23]:
#current_date
#Adds the current date to the DataFrame.

from pyspark.sql.functions import current_date

df_current_date = df.withColumn("current_date", current_date())
df_current_date.show()

+---+-------------+----------+---+-------+------------+
| id|         name|       dob|age| salary|current_date|
+---+-------------+----------+---+-------+------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|  2024-08-16|
|  2|   Jane Smith|2024-08-02| 34|2000.75|  2024-08-16|
|  3|   Jake White|2024-08-03| 18| 3000.1|  2024-08-16|
|  4|   Jill Black|2024-08-04| 45|4000.25|  2024-08-16|
|  5|  James Brown|2024-08-05| 29| 1500.3|  2024-08-16|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|  2024-08-16|
+---+-------------+----------+---+-------+------------+

In [24]:
#current_timestamp
#Adds the current timestamp to the DataFrame.

from pyspark.sql.functions import current_timestamp

df_current_timestamp = df.withColumn("current_timestamp", current_timestamp())
df_current_timestamp.show(truncate=False)

+---+-------------+----------+---+-------+--------------------------+
|id |name         |dob       |age|salary |current_timestamp         |
+---+-------------+----------+---+-------+--------------------------+
|1  |John Doe     |2024-08-01|23 |1000.5 |2024-08-16 13:02:05.950815|
|2  |Jane Smith   |2024-08-02|34 |2000.75|2024-08-16 13:02:05.950815|
|3  |Jake White   |2024-08-03|18 |3000.1 |2024-08-16 13:02:05.950815|
|4  |Jill Black   |2024-08-04|45 |4000.25|2024-08-16 13:02:05.950815|
|5  |James Brown  |2024-08-05|29 |1500.3 |2024-08-16 13:02:05.950815|
|6  |Madhav Mishra|2024-08-06|31 |2500.45|2024-08-16 13:02:05.950815|
+---+-------------+----------+---+-------+--------------------------+

In [25]:
#year, month, dayofmonth
#Extracts the year, month, and day from the "dob" column.

from pyspark.sql.functions import year, month, dayofmonth

df_year = df.withColumn("year", year(col("dob")))
df_year.show()

#from pyspark.sql.functions import year, month, dayofmonth

#df.withColumn("year", year(col("dob"))).withColumn("month", month(col("dob"))).withColumn("day", dayofmonth(col("dob"))).show()

+---+-------------+----------+---+-------+----+
| id|         name|       dob|age| salary|year|
+---+-------------+----------+---+-------+----+
|  1|     John Doe|2024-08-01| 23| 1000.5|2024|
|  2|   Jane Smith|2024-08-02| 34|2000.75|2024|
|  3|   Jake White|2024-08-03| 18| 3000.1|2024|
|  4|   Jill Black|2024-08-04| 45|4000.25|2024|
|  5|  James Brown|2024-08-05| 29| 1500.3|2024|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|2024|
+---+-------------+----------+---+-------+----+

In [26]:
#date_add
#Adds 10 days to the "dob" column.

from pyspark.sql.functions import date_add

df_date_add = df.withColumn("date_after_10_days", date_add(col("dob"), 10))
df_date_add.show()

+---+-------------+----------+---+-------+------------------+
| id|         name|       dob|age| salary|date_after_10_days|
+---+-------------+----------+---+-------+------------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|        2024-08-11|
|  2|   Jane Smith|2024-08-02| 34|2000.75|        2024-08-12|
|  3|   Jake White|2024-08-03| 18| 3000.1|        2024-08-13|
|  4|   Jill Black|2024-08-04| 45|4000.25|        2024-08-14|
|  5|  James Brown|2024-08-05| 29| 1500.3|        2024-08-15|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|        2024-08-16|
+---+-------------+----------+---+-------+------------------+

In [27]:
#date_sub
#Subtracts 10 days from the "dob" column.

from pyspark.sql.functions import date_sub

df_date_sub = df.withColumn("date_before_10_days", date_sub(col("dob"), 10))
df_date_sub.show()

+---+-------------+----------+---+-------+-------------------+
| id|         name|       dob|age| salary|date_before_10_days|
+---+-------------+----------+---+-------+-------------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|         2024-07-22|
|  2|   Jane Smith|2024-08-02| 34|2000.75|         2024-07-23|
|  3|   Jake White|2024-08-03| 18| 3000.1|         2024-07-24|
|  4|   Jill Black|2024-08-04| 45|4000.25|         2024-07-25|
|  5|  James Brown|2024-08-05| 29| 1500.3|         2024-07-26|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|         2024-07-27|
+---+-------------+----------+---+-------+-------------------+

In [28]:
#datediff
#Calculates the difference in days between the current date and the "dob".

from pyspark.sql.functions import datediff

df_date_diff = df.withColumn("days_since_dob", datediff(current_date(), col("dob")))
df_date_diff.show()

+---+-------------+----------+---+-------+--------------+
| id|         name|       dob|age| salary|days_since_dob|
+---+-------------+----------+---+-------+--------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|            15|
|  2|   Jane Smith|2024-08-02| 34|2000.75|            14|
|  3|   Jake White|2024-08-03| 18| 3000.1|            13|
|  4|   Jill Black|2024-08-04| 45|4000.25|            12|
|  5|  James Brown|2024-08-05| 29| 1500.3|            11|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|            10|
+---+-------------+----------+---+-------+--------------+

In [29]:
#to_date
#Converts the "dob" column from string to date format.

from pyspark.sql.functions import to_date

df_to_date = df.withColumn("dob_as_date", to_date(col("dob"), "yyyy-MM-dd"))
df_to_date.show()

+---+-------------+----------+---+-------+-----------+
| id|         name|       dob|age| salary|dob_as_date|
+---+-------------+----------+---+-------+-----------+
|  1|     John Doe|2024-08-01| 23| 1000.5| 2024-08-01|
|  2|   Jane Smith|2024-08-02| 34|2000.75| 2024-08-02|
|  3|   Jake White|2024-08-03| 18| 3000.1| 2024-08-03|
|  4|   Jill Black|2024-08-04| 45|4000.25| 2024-08-04|
|  5|  James Brown|2024-08-05| 29| 1500.3| 2024-08-05|
|  6|Madhav Mishra|2024-08-06| 31|2500.45| 2024-08-06|
+---+-------------+----------+---+-------+-----------+

In [30]:
#to_timestamp
#Converts the "dob" column from string to timestamp format.

from pyspark.sql.functions import to_timestamp

df_to_timestamp = df.withColumn("dob_as_timestamp", to_timestamp(col("dob"), "yyyy-MM-dd"))
df_to_timestamp.show(truncate=False)

+---+-------------+----------+---+-------+-------------------+
|id |name         |dob       |age|salary |dob_as_timestamp   |
+---+-------------+----------+---+-------+-------------------+
|1  |John Doe     |2024-08-01|23 |1000.5 |2024-08-01 00:00:00|
|2  |Jane Smith   |2024-08-02|34 |2000.75|2024-08-02 00:00:00|
|3  |Jake White   |2024-08-03|18 |3000.1 |2024-08-03 00:00:00|
|4  |Jill Black   |2024-08-04|45 |4000.25|2024-08-04 00:00:00|
|5  |James Brown  |2024-08-05|29 |1500.3 |2024-08-05 00:00:00|
|6  |Madhav Mishra|2024-08-06|31 |2500.45|2024-08-06 00:00:00|
+---+-------------+----------+---+-------+-------------------+

In [31]:
# window
#Aggregates the salary over a sliding window of one day.

from pyspark.sql.functions import window

df_window = df.withColumn("window", window(col("dob"), "1 day"))
df_window.show(truncate=False)


#from pyspark.sql.functions import window

#df.groupBy(window(col("dob"), "1 day")).sum("salary").show(truncate=False)

+---+-------------+----------+---+-------+------------------------------------------+
|id |name         |dob       |age|salary |window                                    |
+---+-------------+----------+---+-------+------------------------------------------+
|1  |John Doe     |2024-08-01|23 |1000.5 |{2024-08-01 00:00:00, 2024-08-02 00:00:00}|
|2  |Jane Smith   |2024-08-02|34 |2000.75|{2024-08-02 00:00:00, 2024-08-03 00:00:00}|
|3  |Jake White   |2024-08-03|18 |3000.1 |{2024-08-03 00:00:00, 2024-08-04 00:00:00}|
|4  |Jill Black   |2024-08-04|45 |4000.25|{2024-08-04 00:00:00, 2024-08-05 00:00:00}|
|5  |James Brown  |2024-08-05|29 |1500.3 |{2024-08-05 00:00:00, 2024-08-06 00:00:00}|
|6  |Madhav Mishra|2024-08-06|31 |2500.45|{2024-08-06 00:00:00, 2024-08-07 00:00:00}|
+---+-------------+----------+---+-------+------------------------------------------+

In [32]:
#rank, dense_rank, row_number
#Applies ranking functions to the salary column.
from pyspark.sql.window import Window
from pyspark.sql.functions import rank, dense_rank, row_number

windowSpec = Window.orderBy(col("salary").desc())

df.withColumn("rank", rank().over(windowSpec)).withColumn("dense_rank", dense_rank().over(windowSpec)).withColumn("row_number", row_number().over(windowSpec)).show()

+---+-------------+----------+---+-------+----+----------+----------+
| id|         name|       dob|age| salary|rank|dense_rank|row_number|
+---+-------------+----------+---+-------+----+----------+----------+
|  4|   Jill Black|2024-08-04| 45|4000.25|   1|         1|         1|
|  3|   Jake White|2024-08-03| 18| 3000.1|   2|         2|         2|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|   3|         3|         3|
|  2|   Jane Smith|2024-08-02| 34|2000.75|   4|         4|         4|
|  5|  James Brown|2024-08-05| 29| 1500.3|   5|         5|         5|
|  1|     John Doe|2024-08-01| 23| 1000.5|   6|         6|         6|
+---+-------------+----------+---+-------+----+----------+----------+

In [33]:
#array
#Creates a new array column.

from pyspark.sql.functions import array

df_array = df.withColumn("array_column", array(col("id"), col("age")))
df_array.show()

+---+-------------+----------+---+-------+------------+
| id|         name|       dob|age| salary|array_column|
+---+-------------+----------+---+-------+------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|     [1, 23]|
|  2|   Jane Smith|2024-08-02| 34|2000.75|     [2, 34]|
|  3|   Jake White|2024-08-03| 18| 3000.1|     [3, 18]|
|  4|   Jill Black|2024-08-04| 45|4000.25|     [4, 45]|
|  5|  James Brown|2024-08-05| 29| 1500.3|     [5, 29]|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|     [6, 31]|
+---+-------------+----------+---+-------+------------+

In [34]:
#array_contains
#Checks if a specified element exists in an array column.

from pyspark.sql.functions import array_contains

df_array_contains = df.withColumn("contains_id_1", array_contains(array(col("id")), 1))

df_array_contains.show()

+---+-------------+----------+---+-------+-------------+
| id|         name|       dob|age| salary|contains_id_1|
+---+-------------+----------+---+-------+-------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|         true|
|  2|   Jane Smith|2024-08-02| 34|2000.75|        false|
|  3|   Jake White|2024-08-03| 18| 3000.1|        false|
|  4|   Jill Black|2024-08-04| 45|4000.25|        false|
|  5|  James Brown|2024-08-05| 29| 1500.3|        false|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|        false|
+---+-------------+----------+---+-------+-------------+

In [35]:
#explode
#Creates a new row for each element in the given array or map column.

from pyspark.sql.functions import explode

df_explode = df.withColumn("exploded_array", explode(array(col("id"), col("age"))))
df_explode.show()

+---+-------------+----------+---+-------+--------------+
| id|         name|       dob|age| salary|exploded_array|
+---+-------------+----------+---+-------+--------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|             1|
|  1|     John Doe|2024-08-01| 23| 1000.5|            23|
|  2|   Jane Smith|2024-08-02| 34|2000.75|             2|
|  2|   Jane Smith|2024-08-02| 34|2000.75|            34|
|  3|   Jake White|2024-08-03| 18| 3000.1|             3|
|  3|   Jake White|2024-08-03| 18| 3000.1|            18|
|  4|   Jill Black|2024-08-04| 45|4000.25|             4|
|  4|   Jill Black|2024-08-04| 45|4000.25|            45|
|  5|  James Brown|2024-08-05| 29| 1500.3|             5|
|  5|  James Brown|2024-08-05| 29| 1500.3|            29|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|             6|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|            31|
+---+-------------+----------+---+-------+--------------+

In [39]:
#map
#Creates a new map column.


from pyspark.sql.functions import create_map

df_map = df.withColumn("map_column", create_map(lit("name"), col("name"), lit("age"), col("age")))

df_map.show(truncate=False)

+---+-------------+----------+---+-------+----------------------------------+
|id |name         |dob       |age|salary |map_column                        |
+---+-------------+----------+---+-------+----------------------------------+
|1  |John Doe     |2024-08-01|23 |1000.5 |{name -> John Doe, age -> 23}     |
|2  |Jane Smith   |2024-08-02|34 |2000.75|{name -> Jane Smith, age -> 34}   |
|3  |Jake White   |2024-08-03|18 |3000.1 |{name -> Jake White, age -> 18}   |
|4  |Jill Black   |2024-08-04|45 |4000.25|{name -> Jill Black, age -> 45}   |
|5  |James Brown  |2024-08-05|29 |1500.3 |{name -> James Brown, age -> 29}  |
|6  |Madhav Mishra|2024-08-06|31 |2500.45|{name -> Madhav Mishra, age -> 31}|
+---+-------------+----------+---+-------+----------------------------------+

In [43]:
#coalesce
#Returns the first non-null value among the given columns.

from pyspark.sql.functions import coalesce

df_coalesce = df.withColumn("coalesced_value", coalesce(col("name"), col("age")))
df_coalesce.show()

+---+-------------+----------+---+-------+---------------+
| id|         name|       dob|age| salary|coalesced_value|
+---+-------------+----------+---+-------+---------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|       John Doe|
|  2|   Jane Smith|2024-08-02| 34|2000.75|     Jane Smith|
|  3|   Jake White|2024-08-03| 18| 3000.1|     Jake White|
|  4|   Jill Black|2024-08-04| 45|4000.25|     Jill Black|
|  5|  James Brown|2024-08-05| 29| 1500.3|    James Brown|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|  Madhav Mishra|
+---+-------------+----------+---+-------+---------------+

In [44]:
#isnull
#Checks if the column is null.

from pyspark.sql.functions import isnull

df_isnull = df.withColumn("is_name_null", isnull(col("name")))
df_isnull.show()

+---+-------------+----------+---+-------+------------+
| id|         name|       dob|age| salary|is_name_null|
+---+-------------+----------+---+-------+------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|       false|
|  2|   Jane Smith|2024-08-02| 34|2000.75|       false|
|  3|   Jake White|2024-08-03| 18| 3000.1|       false|
|  4|   Jill Black|2024-08-04| 45|4000.25|       false|
|  5|  James Brown|2024-08-05| 29| 1500.3|       false|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|       false|
+---+-------------+----------+---+-------+------------+

In [45]:
#isnan
#Checks if the column is NaN.

from pyspark.sql.functions import isnan

df_isnan = df.withColumn("is_age_nan", isnan(col("age")))
df_isnan.show()

+---+-------------+----------+---+-------+----------+
| id|         name|       dob|age| salary|is_age_nan|
+---+-------------+----------+---+-------+----------+
|  1|     John Doe|2024-08-01| 23| 1000.5|     false|
|  2|   Jane Smith|2024-08-02| 34|2000.75|     false|
|  3|   Jake White|2024-08-03| 18| 3000.1|     false|
|  4|   Jill Black|2024-08-04| 45|4000.25|     false|
|  5|  James Brown|2024-08-05| 29| 1500.3|     false|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|     false|
+---+-------------+----------+---+-------+----------+

In [46]:
#sha2
#Applies the SHA-2 hash function to the column.

from pyspark.sql.functions import sha2

df_sha2 = df.withColumn("sha2_hash", sha2(col("name"), 256))
df_sha2.show(truncate=False)

+---+-------------+----------+---+-------+----------------------------------------------------------------+
|id |name         |dob       |age|salary |sha2_hash                                                       |
+---+-------------+----------+---+-------+----------------------------------------------------------------+
|1  |John Doe     |2024-08-01|23 |1000.5 |6cea57c2fb6cbc2a40411135005760f241fffc3e5e67ab99882726431037f908|
|2  |Jane Smith   |2024-08-02|34 |2000.75|a2dd3acadb1c9dcd956216993056a7f50a9db6e3a16c60b35482139b5349c288|
|3  |Jake White   |2024-08-03|18 |3000.1 |46dae60ac51d1dfbb195b62ca2a6c4fd76f0d0ef5e32ee32a3b9987bc30251ef|
|4  |Jill Black   |2024-08-04|45 |4000.25|7db233fa461a23bfe24e0c1b5f0cd82e8750969c1e9c4450761cf800425caba7|
|5  |James Brown  |2024-08-05|29 |1500.3 |b3d60509901a9912f651bac21d52c7ddffc9bc8620f5052fbddd39e3c59f84b0|
|6  |Madhav Mishra|2024-08-06|31 |2500.45|4cdec17dacd6ffe870947ac1cb6d10901adf819458055ab02df4a3540dd3f477|
+---+-------------+----------+---+-------+----------------------------------------------------------------+

In [47]:
#md5
#Calculates the MD5 hash of a column.

from pyspark.sql.functions import md5

df_md5 = df.withColumn("md5_hash", md5(col("name")))
df_md5.show(truncate=False)

+---+-------------+----------+---+-------+--------------------------------+
|id |name         |dob       |age|salary |md5_hash                        |
+---+-------------+----------+---+-------+--------------------------------+
|1  |John Doe     |2024-08-01|23 |1000.5 |4c2a904bafba06591225113ad17b5cec|
|2  |Jane Smith   |2024-08-02|34 |2000.75|71768b5e2a0b3697eb3c0c6d4ebbbaf8|
|3  |Jake White   |2024-08-03|18 |3000.1 |3ee9984296bc94702c3fa0b750b928fb|
|4  |Jill Black   |2024-08-04|45 |4000.25|78b82745b366583ae84dde2d90114901|
|5  |James Brown  |2024-08-05|29 |1500.3 |8495e8e406d3d625719ae2a9fb8d2f9b|
|6  |Madhav Mishra|2024-08-06|31 |2500.45|80d7e488885a319a5fb5ea29fe6b526b|
+---+-------------+----------+---+-------+--------------------------------+

In [49]:
#monotonically_increasing_id
#Generates a unique, monotonically increasing 64-bit integer for each row.

from pyspark.sql.functions import monotonically_increasing_id

df_monotonically_increasing_id = df.withColumn("monotonically_increasing_id", monotonically_increasing_id())
df_monotonically_increasing_id.show()

+---+-------------+----------+---+-------+---------------------------+
| id|         name|       dob|age| salary|monotonically_increasing_id|
+---+-------------+----------+---+-------+---------------------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|                          0|
|  2|   Jane Smith|2024-08-02| 34|2000.75|                          1|
|  3|   Jake White|2024-08-03| 18| 3000.1|                          2|
|  4|   Jill Black|2024-08-04| 45|4000.25|                 8589934592|
|  5|  James Brown|2024-08-05| 29| 1500.3|                 8589934593|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|                 8589934594|
+---+-------------+----------+---+-------+---------------------------+

In [50]:
#length
#Returns the length of a string column.

from pyspark.sql.functions import length

df_length = df.withColumn("name_length", length(col("name")))
df_length.show()

+---+-------------+----------+---+-------+-----------+
| id|         name|       dob|age| salary|name_length|
+---+-------------+----------+---+-------+-----------+
|  1|     John Doe|2024-08-01| 23| 1000.5|          8|
|  2|   Jane Smith|2024-08-02| 34|2000.75|         10|
|  3|   Jake White|2024-08-03| 18| 3000.1|         10|
|  4|   Jill Black|2024-08-04| 45|4000.25|         10|
|  5|  James Brown|2024-08-05| 29| 1500.3|         11|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|         13|
+---+-------------+----------+---+-------+-----------+

In [52]:
#upper and lower
#Converts all characters of a string column to upper or lower case.

from pyspark.sql.functions import upper, lower

#df_upper = df.withColumn("upper_name", upper(col("name")))
#df_upper.show()


from pyspark.sql.functions import upper, lower

df_upper_lower = df.withColumn("name_upper", upper(col("name"))).withColumn("name_lower", lower(col("name")))
df_upper_lower.show()

+---+-------------+----------+---+-------+-------------+-------------+
| id|         name|       dob|age| salary|   name_upper|   name_lower|
+---+-------------+----------+---+-------+-------------+-------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|     JOHN DOE|     john doe|
|  2|   Jane Smith|2024-08-02| 34|2000.75|   JANE SMITH|   jane smith|
|  3|   Jake White|2024-08-03| 18| 3000.1|   JAKE WHITE|   jake white|
|  4|   Jill Black|2024-08-04| 45|4000.25|   JILL BLACK|   jill black|
|  5|  James Brown|2024-08-05| 29| 1500.3|  JAMES BROWN|  james brown|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|MADHAV MISHRA|madhav mishra|
+---+-------------+----------+---+-------+-------------+-------------+

In [53]:
#trim, ltrim, rtrim
#Trims spaces from both sides, left side, or right side of a string column.

from pyspark.sql.functions import trim, ltrim, rtrim
"""
df_trim = df.withColumn("trimmed_name", trim(col("name")))
df_trim.show()

df_ltrim = df.withColumn("ltrimmed_name", ltrim(col("name")))
df_ltrim.show()

df_rtrim = df.withColumn("rtrimmed_name", rtrim(col("name")))
df_rtrim.show()
"""


from pyspark.sql.functions import trim, ltrim, rtrim

df_all = df.withColumn("name_trimmed", trim(col("name"))).withColumn("name_ltrimmed", ltrim(col("name"))).withColumn("name_rtrimmed", rtrim(col("name")))
df_all.show()

+---+-------------+----------+---+-------+-------------+-------------+-------------+
| id|         name|       dob|age| salary| name_trimmed|name_ltrimmed|name_rtrimmed|
+---+-------------+----------+---+-------+-------------+-------------+-------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|     John Doe|     John Doe|     John Doe|
|  2|   Jane Smith|2024-08-02| 34|2000.75|   Jane Smith|   Jane Smith|   Jane Smith|
|  3|   Jake White|2024-08-03| 18| 3000.1|   Jake White|   Jake White|   Jake White|
|  4|   Jill Black|2024-08-04| 45|4000.25|   Jill Black|   Jill Black|   Jill Black|
|  5|  James Brown|2024-08-05| 29| 1500.3|  James Brown|  James Brown|  James Brown|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|Madhav Mishra|Madhav Mishra|Madhav Mishra|
+---+-------------+----------+---+-------+-------------+-------------+-------------+

In [55]:
#abs
#Returns the absolute value of a numeric column.

from pyspark.sql.functions import abs

#df_abs = df.withColumn("absolute_age", abs(col("age")))
#df_abs.show()

from pyspark.sql.functions import abs

df_abs = df.withColumn("abs_salary", abs(col("salary") - 3000))
df_abs.show()

+---+-------------+----------+---+-------+-------------------+
| id|         name|       dob|age| salary|         abs_salary|
+---+-------------+----------+---+-------+-------------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|             1999.5|
|  2|   Jane Smith|2024-08-02| 34|2000.75|             999.25|
|  3|   Jake White|2024-08-03| 18| 3000.1|0.09999999999990905|
|  4|   Jill Black|2024-08-04| 45|4000.25|            1000.25|
|  5|  James Brown|2024-08-05| 29| 1500.3|             1499.7|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|  499.5500000000002|
+---+-------------+----------+---+-------+-------------------+

In [56]:
#sqrt
#Returns the square root of a numeric column.

from pyspark.sql.functions import sqrt

df_sqrt = df.withColumn("sqrt_age", sqrt(col("age")))
df_sqrt.show()

+---+-------------+----------+---+-------+------------------+
| id|         name|       dob|age| salary|          sqrt_age|
+---+-------------+----------+---+-------+------------------+
|  1|     John Doe|2024-08-01| 23| 1000.5| 4.795831523312719|
|  2|   Jane Smith|2024-08-02| 34|2000.75| 5.830951894845301|
|  3|   Jake White|2024-08-03| 18| 3000.1| 4.242640687119285|
|  4|   Jill Black|2024-08-04| 45|4000.25| 6.708203932499369|
|  5|  James Brown|2024-08-05| 29| 1500.3| 5.385164807134504|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|5.5677643628300215|
+---+-------------+----------+---+-------+------------------+

In [58]:
#exp
#Computes the exponential of the given column.

from pyspark.sql.functions import exp

#df_exp = df.withColumn("exp_salary", exp(col("salary")))
#df_exp.show()

from pyspark.sql.functions import exp

df_exp= df.withColumn("exp_age", exp(col("age")))
df_exp.show()

+---+-------------+----------+---+-------+--------------------+
| id|         name|       dob|age| salary|             exp_age|
+---+-------------+----------+---+-------+--------------------+
|  1|     John Doe|2024-08-01| 23| 1000.5| 9.744803446248903E9|
|  2|   Jane Smith|2024-08-02| 34|2000.75|5.834617425274549E14|
|  3|   Jake White|2024-08-03| 18| 3000.1| 6.565996913733051E7|
|  4|   Jill Black|2024-08-04| 45|4000.25|3.493427105748509...|
|  5|  James Brown|2024-08-05| 29| 1500.3|3.931334297144042E12|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|2.904884966524742...|
+---+-------------+----------+---+-------+--------------------+

In [59]:
#log, log10, log2
#Computes the logarithm of the column using a base of e, 10, or 2.

from pyspark.sql.functions import log, log10, log2

#df_log = df.withColumn("log_salary", log(col("salary")))
#df_log.show()

#df_log = df.withColumn("log_salary", log10(col("salary")))
#df_log.show()

#df_log = df.withColumn("log_salary", log2(col("salary")))
#df_log.show()

df_all = df.withColumn("log_age", log(col("age"))).withColumn("log10_age", log10(col("age"))).withColumn("log2_age", log2(col("age")))
df_all.show()

+---+-------------+----------+---+-------+------------------+------------------+-----------------+
| id|         name|       dob|age| salary|           log_age|         log10_age|         log2_age|
+---+-------------+----------+---+-------+------------------+------------------+-----------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|3.1354942159291497|1.3617278360175928|4.523561956057013|
|  2|   Jane Smith|2024-08-02| 34|2000.75|3.5263605246161616|1.5314789170422551| 5.08746284125034|
|  3|   Jake White|2024-08-03| 18| 3000.1|2.8903717578961645| 1.255272505103306|4.169925001442312|
|  4|   Jill Black|2024-08-04| 45|4000.25|3.8066624897703196|1.6532125137753437|5.491853096329675|
|  5|  James Brown|2024-08-05| 29| 1500.3| 3.367295829986474| 1.462397997898956|4.857980995127573|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|3.4339872044851463|1.4913616938342726|4.954196310386876|
+---+-------------+----------+---+-------+------------------+------------------+-----------------+

In [62]:
#greatest and least
#Returns the greatest or least value of the list of columns.

from pyspark.sql.functions import greatest, least

df_greatest = df.withColumn("greatest_value", greatest(col("id"), col("age")))
print(df_greatest.show())

df_least = df.withColumn("least_value", least(col("id"), col("age")))
print(df_least.show())

#df_all = df.withColumn("max_value", greatest(col("age"), col("salary"))).withColumn("min_value", least(col("age"), col("salary")))
#df_all.show()

+---+-------------+----------+---+-------+--------------+
| id|         name|       dob|age| salary|greatest_value|
+---+-------------+----------+---+-------+--------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|            23|
|  2|   Jane Smith|2024-08-02| 34|2000.75|            34|
|  3|   Jake White|2024-08-03| 18| 3000.1|            18|
|  4|   Jill Black|2024-08-04| 45|4000.25|            45|
|  5|  James Brown|2024-08-05| 29| 1500.3|            29|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|            31|
+---+-------------+----------+---+-------+--------------+

None
+---+-------------+----------+---+-------+-----------+
| id|         name|       dob|age| salary|least_value|
+---+-------------+----------+---+-------+-----------+
|  1|     John Doe|2024-08-01| 23| 1000.5|          1|
|  2|   Jane Smith|2024-08-02| 34|2000.75|          2|
|  3|   Jake White|2024-08-03| 18| 3000.1|          3|
|  4|   Jill Black|2024-08-04| 45|4000.25|          4|
|  5|  James Brown|2024-08-05| 29| 1500.3|          5|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|          6|
+---+-------------+----------+---+-------+-----------+

None

In [64]:
#pow
#Raises the value of a column to the power of another column.

from pyspark.sql.functions import pow

df_pow = df.withColumn("pow_result", pow(col("id"), col("age")))
df_pow.show(truncate=False)

+---+-------------+----------+---+-------+---------------------+
|id |name         |dob       |age|salary |pow_result           |
+---+-------------+----------+---+-------+---------------------+
|1  |John Doe     |2024-08-01|23 |1000.5 |1.0                  |
|2  |Jane Smith   |2024-08-02|34 |2000.75|1.7179869184E10      |
|3  |Jake White   |2024-08-03|18 |3000.1 |3.87420489E8         |
|4  |Jill Black   |2024-08-04|45 |4000.25|1.2379400392853803E27|
|5  |James Brown  |2024-08-05|29 |1500.3 |1.8626451492309572E20|
|6  |Madhav Mishra|2024-08-06|31 |2500.45|1.3264435183244001E24|
+---+-------------+----------+---+-------+---------------------+

In [65]:
#round, bround
#Rounds the value of the column to the nearest integer or to the nearest integer with ties broken by rounding away from zero.

from pyspark.sql.functions import round, bround

df_round = df.withColumn("rounded_salary", round(col("salary"), 0))
print(df_round.show())

df_bround = df.withColumn("brounded_salary", bround(col("salary"), 0))
print(df_bround.show())

#df_all = df.withColumn("rounded_salary", round(col("salary"), 0)).withColumn("brounded_salary", bround(col("salary"), 0))
#df_all.show()

+---+-------------+----------+---+-------+--------------+
| id|         name|       dob|age| salary|rounded_salary|
+---+-------------+----------+---+-------+--------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|        1001.0|
|  2|   Jane Smith|2024-08-02| 34|2000.75|        2001.0|
|  3|   Jake White|2024-08-03| 18| 3000.1|        3000.0|
|  4|   Jill Black|2024-08-04| 45|4000.25|        4000.0|
|  5|  James Brown|2024-08-05| 29| 1500.3|        1500.0|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|        2500.0|
+---+-------------+----------+---+-------+--------------+

None
+---+-------------+----------+---+-------+---------------+
| id|         name|       dob|age| salary|brounded_salary|
+---+-------------+----------+---+-------+---------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|         1000.0|
|  2|   Jane Smith|2024-08-02| 34|2000.75|         2001.0|
|  3|   Jake White|2024-08-03| 18| 3000.1|         3000.0|
|  4|   Jill Black|2024-08-04| 45|4000.25|         4000.0|
|  5|  James Brown|2024-08-05| 29| 1500.3|         1500.0|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|         2500.0|
+---+-------------+----------+---+-------+---------------+

None

In [66]:
#degrees, radians
#Converts an angle from radians to degrees or from degrees to radians.

from pyspark.sql.functions import degrees, radians

df_degrees = df.withColumn("degrees_value", degrees(col("age")))
print(df_degrees.show())

df_radians = df.withColumn("radians_value", radians(col("age")))
print(df_radians.show())

#df_all = df.withColumn("degrees_value", degrees(col("age"))).withColumn("radians_value", radians(col("age")))
#df_all.show()

+---+-------------+----------+---+-------+------------------+
| id|         name|       dob|age| salary|     degrees_value|
+---+-------------+----------+---+-------+------------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|1317.8029288008934|
|  2|   Jane Smith|2024-08-02| 34|2000.75| 1948.056503444799|
|  3|   Jake White|2024-08-03| 18| 3000.1| 1031.324031235482|
|  4|   Jill Black|2024-08-04| 45|4000.25|2578.3100780887044|
|  5|  James Brown|2024-08-05| 29| 1500.3|1661.5776058793874|
|  6|Madhav Mishra|2024-08-06| 31|2500.45| 1776.169164905552|
+---+-------------+----------+---+-------+------------------+

None
+---+-------------+----------+---+-------+------------------+
| id|         name|       dob|age| salary|     radians_value|
+---+-------------+----------+---+-------+------------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|0.4014257279586958|
|  2|   Jane Smith|2024-08-02| 34|2000.75|0.5934119456780721|
|  3|   Jake White|2024-08-03| 18| 3000.1|0.3141592653589793|
|  4|   Jill Black|2024-08-04| 45|4000.25|0.7853981633974483|
|  5|  James Brown|2024-08-05| 29| 1500.3|0.5061454830783556|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|0.5410520681182421|
+---+-------------+----------+---+-------+------------------+

None

In [67]:
#signum
#Computes the signum of a number: -1 if it's negative, 0 if it's zero, and 1 if it's positive.

from pyspark.sql.functions import signum

df_signum = df.withColumn("signum_value", signum(col("age")))
df_signum.show()

+---+-------------+----------+---+-------+------------+
| id|         name|       dob|age| salary|signum_value|
+---+-------------+----------+---+-------+------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|         1.0|
|  2|   Jane Smith|2024-08-02| 34|2000.75|         1.0|
|  3|   Jake White|2024-08-03| 18| 3000.1|         1.0|
|  4|   Jill Black|2024-08-04| 45|4000.25|         1.0|
|  5|  James Brown|2024-08-05| 29| 1500.3|         1.0|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|         1.0|
+---+-------------+----------+---+-------+------------+

In [70]:
#hex, unhex
#Converts a column to hexadecimal and back.

from pyspark.sql.functions import hex, unhex

# Create the 'hex_value' column within the 'df' DataFrame
#df = df.withColumn("hex_value", hex(col("age")))
#print(df.show())

#df_unhex = df.withColumn("unhex_value", unhex(col("hex_value")))
#print(df_unhex.show())




from pyspark.sql.functions import hex, unhex

df_all= df.withColumn("hex_name", hex(col("id"))).withColumn("unhex_name", unhex(hex(col("id"))))
df_all.show()

+---+-------------+----------+---+-------+---------+--------+----------+
| id|         name|       dob|age| salary|hex_value|hex_name|unhex_name|
+---+-------------+----------+---+-------+---------+--------+----------+
|  1|     John Doe|2024-08-01| 23| 1000.5|       17|       1|      [01]|
|  2|   Jane Smith|2024-08-02| 34|2000.75|       22|       2|      [02]|
|  3|   Jake White|2024-08-03| 18| 3000.1|       12|       3|      [03]|
|  4|   Jill Black|2024-08-04| 45|4000.25|       2D|       4|      [04]|
|  5|  James Brown|2024-08-05| 29| 1500.3|       1D|       5|      [05]|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|       1F|       6|      [06]|
+---+-------------+----------+---+-------+---------+--------+----------+

In [72]:
#nvl, nvl2
#Replaces null values with the specified value.

from pyspark.sql.functions import nvl, nvl2, col

df_nvl = df.withColumn("nvl_age", nvl(col("age"), col("id"))) # Replace 0 with a column object
print(df_nvl.show())

df_nvl2 = df.withColumn("nvl2_age", nvl2(col("age"), col("id"), col("salary"))) # Replace 0 and 10 with column objects
print(df_nvl2.show())

# df_all = df.withColumn("nvl_column", expr("nvl(null, 'default')"))
# df_all.show()

+---+-------------+----------+---+-------+---------+-------+
| id|         name|       dob|age| salary|hex_value|nvl_age|
+---+-------------+----------+---+-------+---------+-------+
|  1|     John Doe|2024-08-01| 23| 1000.5|       17|     23|
|  2|   Jane Smith|2024-08-02| 34|2000.75|       22|     34|
|  3|   Jake White|2024-08-03| 18| 3000.1|       12|     18|
|  4|   Jill Black|2024-08-04| 45|4000.25|       2D|     45|
|  5|  James Brown|2024-08-05| 29| 1500.3|       1D|     29|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|       1F|     31|
+---+-------------+----------+---+-------+---------+-------+

None
+---+-------------+----------+---+-------+---------+--------+
| id|         name|       dob|age| salary|hex_value|nvl2_age|
+---+-------------+----------+---+-------+---------+--------+
|  1|     John Doe|2024-08-01| 23| 1000.5|       17|     1.0|
|  2|   Jane Smith|2024-08-02| 34|2000.75|       22|     2.0|
|  3|   Jake White|2024-08-03| 18| 3000.1|       12|     3.0|
|  4|   Jill Black|2024-08-04| 45|4000.25|       2D|     4.0|
|  5|  James Brown|2024-08-05| 29| 1500.3|       1D|     5.0|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|       1F|     6.0|
+---+-------------+----------+---+-------+---------+--------+

None

In [73]:
#reverse
#Reverses the string in a column.

from pyspark.sql.functions import reverse

df_reverse = df.withColumn("reversed_name", reverse(col("name")))
df_reverse.show()

+---+-------------+----------+---+-------+---------+-------------+
| id|         name|       dob|age| salary|hex_value|reversed_name|
+---+-------------+----------+---+-------+---------+-------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|       17|     eoD nhoJ|
|  2|   Jane Smith|2024-08-02| 34|2000.75|       22|   htimS enaJ|
|  3|   Jake White|2024-08-03| 18| 3000.1|       12|   etihW ekaJ|
|  4|   Jill Black|2024-08-04| 45|4000.25|       2D|   kcalB lliJ|
|  5|  James Brown|2024-08-05| 29| 1500.3|       1D|  nworB semaJ|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|       1F|arhsiM vahdaM|
+---+-------------+----------+---+-------+---------+-------------+

In [74]:
#initcap
#Converts the first letter of each word to uppercase.

from pyspark.sql.functions import initcap

df_initcap = df.withColumn("capitalized_name", initcap(col("name")))
df_initcap.show()

+---+-------------+----------+---+-------+---------+----------------+
| id|         name|       dob|age| salary|hex_value|capitalized_name|
+---+-------------+----------+---+-------+---------+----------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|       17|        John Doe|
|  2|   Jane Smith|2024-08-02| 34|2000.75|       22|      Jane Smith|
|  3|   Jake White|2024-08-03| 18| 3000.1|       12|      Jake White|
|  4|   Jill Black|2024-08-04| 45|4000.25|       2D|      Jill Black|
|  5|  James Brown|2024-08-05| 29| 1500.3|       1D|     James Brown|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|       1F|   Madhav Mishra|
+---+-------------+----------+---+-------+---------+----------------+

In [78]:
#instr
#Returns the position of the first occurrence of a substring.

from pyspark.sql.functions import instr

df_instr = df.withColumn("position_of_a", instr(col("name"), "a"))
print(df_instr.show())
print(df_instr.printSchema())

#df_instr = df.withColumn("position", instr(col("name"), "Doe"))
#df_instr.show()

+---+-------------+----------+---+-------+---------+-------------+
| id|         name|       dob|age| salary|hex_value|position_of_a|
+---+-------------+----------+---+-------+---------+-------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|       17|            0|
|  2|   Jane Smith|2024-08-02| 34|2000.75|       22|            2|
|  3|   Jake White|2024-08-03| 18| 3000.1|       12|            2|
|  4|   Jill Black|2024-08-04| 45|4000.25|       2D|            8|
|  5|  James Brown|2024-08-05| 29| 1500.3|       1D|            2|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|       1F|            2|
+---+-------------+----------+---+-------+---------+-------------+

None
root
 |-- id: long (nullable = true)
 |-- name: string (nullable = true)
 |-- dob: string (nullable = true)
 |-- age: long (nullable = true)
 |-- salary: double (nullable = true)
 |-- hex_value: string (nullable = true)
 |-- position_of_a: integer (nullable = true)

None

In [79]:
#locate
#Similar to instr, but can start the search from a specified position.
from pyspark.sql.functions import locate

df_locate = df.withColumn("locate_doe", locate("Doe", col("name")))
df_locate.show()

+---+-------------+----------+---+-------+---------+----------+
| id|         name|       dob|age| salary|hex_value|locate_doe|
+---+-------------+----------+---+-------+---------+----------+
|  1|     John Doe|2024-08-01| 23| 1000.5|       17|         6|
|  2|   Jane Smith|2024-08-02| 34|2000.75|       22|         0|
|  3|   Jake White|2024-08-03| 18| 3000.1|       12|         0|
|  4|   Jill Black|2024-08-04| 45|4000.25|       2D|         0|
|  5|  James Brown|2024-08-05| 29| 1500.3|       1D|         0|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|       1F|         0|
+---+-------------+----------+---+-------+---------+----------+

In [80]:
#soundex
#Converts a string to its Soundex code, useful for phonetic matching

from pyspark.sql.functions import soundex

df_soundex = df.withColumn("soundex_name", soundex(col("name")))
df_soundex.show()

+---+-------------+----------+---+-------+---------+------------+
| id|         name|       dob|age| salary|hex_value|soundex_name|
+---+-------------+----------+---+-------+---------+------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|       17|        J530|
|  2|   Jane Smith|2024-08-02| 34|2000.75|       22|        J525|
|  3|   Jake White|2024-08-03| 18| 3000.1|       12|        J230|
|  4|   Jill Black|2024-08-04| 45|4000.25|       2D|        J414|
|  5|  James Brown|2024-08-05| 29| 1500.3|       1D|        J521|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|       1F|        M315|
+---+-------------+----------+---+-------+---------+------------+

In [83]:
#levenshtein
#Computes the Levenshtein distance between two strings.

from pyspark.sql.functions import levenshtein

df_levenshtein = df.withColumn("levenshtein_distance", levenshtein(col("name"), lit("Jon Doe")))
df_levenshtein.show()

+---+-------------+----------+---+-------+---------+--------------------+
| id|         name|       dob|age| salary|hex_value|levenshtein_distance|
+---+-------------+----------+---+-------+---------+--------------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|       17|                   1|
|  2|   Jane Smith|2024-08-02| 34|2000.75|       22|                   7|
|  3|   Jake White|2024-08-03| 18| 3000.1|       12|                   7|
|  4|   Jill Black|2024-08-04| 45|4000.25|       2D|                   8|
|  5|  James Brown|2024-08-05| 29| 1500.3|       1D|                   8|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|       1F|                  12|
+---+-------------+----------+---+-------+---------+--------------------+

In [84]:
#conv
#Converts a number from one base to another.

from pyspark.sql.functions import conv

df_conv = df.withColumn("binary_value", conv(col("id"), 10, 2))
df_conv.show()

+---+-------------+----------+---+-------+---------+------------+
| id|         name|       dob|age| salary|hex_value|binary_value|
+---+-------------+----------+---+-------+---------+------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|       17|           1|
|  2|   Jane Smith|2024-08-02| 34|2000.75|       22|          10|
|  3|   Jake White|2024-08-03| 18| 3000.1|       12|          11|
|  4|   Jill Black|2024-08-04| 45|4000.25|       2D|         100|
|  5|  James Brown|2024-08-05| 29| 1500.3|       1D|         101|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|       1F|         110|
+---+-------------+----------+---+-------+---------+------------+

In [86]:
#translate
#Replaces characters in a string with other characters.

from pyspark.sql.functions import translate

df_translate = df.withColumn("translated_name", translate(col("name"), "o", "a"))
df_translate.show()

+---+-------------+----------+---+-------+---------+---------------+
| id|         name|       dob|age| salary|hex_value|translated_name|
+---+-------------+----------+---+-------+---------+---------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|       17|       Jahn Dae|
|  2|   Jane Smith|2024-08-02| 34|2000.75|       22|     Jane Smith|
|  3|   Jake White|2024-08-03| 18| 3000.1|       12|     Jake White|
|  4|   Jill Black|2024-08-04| 45|4000.25|       2D|     Jill Black|
|  5|  James Brown|2024-08-05| 29| 1500.3|       1D|    James Brawn|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|       1F|  Madhav Mishra|
+---+-------------+----------+---+-------+---------+---------------+

In [87]:
#crc32
#Computes a cyclic redundancy check value

from pyspark.sql.functions import crc32

df_crc32 = df.withColumn("crc32_name", crc32(col("name")))
df_crc32.show()

+---+-------------+----------+---+-------+---------+----------+
| id|         name|       dob|age| salary|hex_value|crc32_name|
+---+-------------+----------+---+-------+---------+----------+
|  1|     John Doe|2024-08-01| 23| 1000.5|       17|1782059462|
|  2|   Jane Smith|2024-08-02| 34|2000.75|       22|3280634359|
|  3|   Jake White|2024-08-03| 18| 3000.1|       12| 931505628|
|  4|   Jill Black|2024-08-04| 45|4000.25|       2D|3628743810|
|  5|  James Brown|2024-08-05| 29| 1500.3|       1D|3837056040|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|       1F|3046363580|
+---+-------------+----------+---+-------+---------+----------+

In [90]:
#uuid
#Generates a column of UUIDs.

from pyspark.sql.functions import expr

df_uuid = df.withColumn("uuid", expr("uuid()"))

df_uuid.show(truncate = False)

+---+-------------+----------+---+-------+---------+------------------------------------+
|id |name         |dob       |age|salary |hex_value|uuid                                |
+---+-------------+----------+---+-------+---------+------------------------------------+
|1  |John Doe     |2024-08-01|23 |1000.5 |17       |357e9744-9632-441e-bc51-65af8852f79a|
|2  |Jane Smith   |2024-08-02|34 |2000.75|22       |9a05fd51-b9b9-4981-905a-8796bce1fb4d|
|3  |Jake White   |2024-08-03|18 |3000.1 |12       |4015d93c-c04b-466c-bbcd-e4624e65defa|
|4  |Jill Black   |2024-08-04|45 |4000.25|2D       |143c8d30-cd29-4347-bebb-c61ef2674d82|
|5  |James Brown  |2024-08-05|29 |1500.3 |1D       |8f3c80a5-29f8-4008-b14a-129cf4a81f39|
|6  |Madhav Mishra|2024-08-06|31 |2500.45|1F       |557e3429-720a-4c34-ae07-e7cd8c899c8d|
+---+-------------+----------+---+-------+---------+------------------------------------+

In [91]:
#percent_rank
#Computes the percent rank of a row within a window partition.

from pyspark.sql.functions import percent_rank

windowSpec = Window.orderBy(col("salary").desc())

df_percent_rank = df.withColumn("percent_rank", percent_rank().over(windowSpec))
df_percent_rank.show()

+---+-------------+----------+---+-------+---------+------------+
| id|         name|       dob|age| salary|hex_value|percent_rank|
+---+-------------+----------+---+-------+---------+------------+
|  4|   Jill Black|2024-08-04| 45|4000.25|       2D|         0.0|
|  3|   Jake White|2024-08-03| 18| 3000.1|       12|         0.2|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|       1F|         0.4|
|  2|   Jane Smith|2024-08-02| 34|2000.75|       22|         0.6|
|  5|  James Brown|2024-08-05| 29| 1500.3|       1D|         0.8|
|  1|     John Doe|2024-08-01| 23| 1000.5|       17|         1.0|
+---+-------------+----------+---+-------+---------+------------+

In [92]:
#cume_dist
#Computes the cumulative distribution of a value in a group of values.

from pyspark.sql.functions import cume_dist

df_cume_dist = df.withColumn("cume_dist", cume_dist().over(windowSpec))
df_cume_dist.show()

+---+-------------+----------+---+-------+---------+-------------------+
| id|         name|       dob|age| salary|hex_value|          cume_dist|
+---+-------------+----------+---+-------+---------+-------------------+
|  4|   Jill Black|2024-08-04| 45|4000.25|       2D|0.16666666666666666|
|  3|   Jake White|2024-08-03| 18| 3000.1|       12| 0.3333333333333333|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|       1F|                0.5|
|  2|   Jane Smith|2024-08-02| 34|2000.75|       22| 0.6666666666666666|
|  5|  James Brown|2024-08-05| 29| 1500.3|       1D| 0.8333333333333334|
|  1|     John Doe|2024-08-01| 23| 1000.5|       17|                1.0|
+---+-------------+----------+---+-------+---------+-------------------+

In [93]:
#ntile
#Distributes rows of an ordered partition into a specified number of buckets.

from pyspark.sql.functions import ntile

df_ntile = df.withColumn("ntile", ntile(3).over(windowSpec))
df_ntile.show()

+---+-------------+----------+---+-------+---------+-----+
| id|         name|       dob|age| salary|hex_value|ntile|
+---+-------------+----------+---+-------+---------+-----+
|  4|   Jill Black|2024-08-04| 45|4000.25|       2D|    1|
|  3|   Jake White|2024-08-03| 18| 3000.1|       12|    1|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|       1F|    2|
|  2|   Jane Smith|2024-08-02| 34|2000.75|       22|    2|
|  5|  James Brown|2024-08-05| 29| 1500.3|       1D|    3|
|  1|     John Doe|2024-08-01| 23| 1000.5|       17|    3|
+---+-------------+----------+---+-------+---------+-----+

In [96]:
#flatten
#Flattens an array of arrays into a single array.

from pyspark.sql.functions import flatten

df_flatten = df.withColumn("flattened_array", flatten(array(array(lit(1), lit(2)), array(lit(3)))))

df_flatten.show()

+---+-------------+----------+---+-------+---------+---------------+
| id|         name|       dob|age| salary|hex_value|flattened_array|
+---+-------------+----------+---+-------+---------+---------------+
|  1|     John Doe|2024-08-01| 23| 1000.5|       17|      [1, 2, 3]|
|  2|   Jane Smith|2024-08-02| 34|2000.75|       22|      [1, 2, 3]|
|  3|   Jake White|2024-08-03| 18| 3000.1|       12|      [1, 2, 3]|
|  4|   Jill Black|2024-08-04| 45|4000.25|       2D|      [1, 2, 3]|
|  5|  James Brown|2024-08-05| 29| 1500.3|       1D|      [1, 2, 3]|
|  6|Madhav Mishra|2024-08-06| 31|2500.45|       1F|      [1, 2, 3]|
+---+-------------+----------+---+-------+---------+---------------+

In [101]:
#grouping_id
#Returns the level of grouping applied.

from pyspark.sql.functions import grouping_id
from pyspark.sql import functions as F

# Use GroupingSets to create multiple grouping levels
df_grouping_sets = df.cube("age", "salary").agg(grouping_id().alias("grouping_id"), F.sum("salary"))
df_grouping_sets.show()

+----+-------+-----------+-----------+
| age| salary|grouping_id|sum(salary)|
+----+-------+-----------+-----------+
|NULL| 1000.5|          2|     1000.5|
|  34|   NULL|          1|    2000.75|
|NULL| 3000.1|          2|     3000.1|
|NULL|   NULL|          3|   14002.35|
|  23|   NULL|          1|     1000.5|
|  34|2000.75|          0|    2000.75|
|NULL|2000.75|          2|    2000.75|
|  23| 1000.5|          0|     1000.5|
|  18| 3000.1|          0|     3000.1|
|  18|   NULL|          1|     3000.1|
|  29| 1500.3|          0|     1500.3|
|NULL| 1500.3|          2|     1500.3|
|  45|   NULL|          1|    4000.25|
|NULL|4000.25|          2|    4000.25|
|  29|   NULL|          1|     1500.3|
|  45|4000.25|          0|    4000.25|
|NULL|2500.45|          2|    2500.45|
|  31|   NULL|          1|    2500.45|
|  31|2500.45|          0|    2500.45|
+----+-------+-----------+-----------+

In [104]:
#rollup
#Used for multi-dimensional aggregates, similar to cube but with a subset of it.

#from pyspark.sql.functions import rollup

df_rollup = df.rollup("age", "salary").count()
df_rollup.show()

+----+-------+-----+
| age| salary|count|
+----+-------+-----+
|  34|   NULL|    1|
|NULL|   NULL|    6|
|  23|   NULL|    1|
|  34|2000.75|    1|
|  23| 1000.5|    1|
|  18| 3000.1|    1|
|  18|   NULL|    1|
|  29| 1500.3|    1|
|  45|   NULL|    1|
|  29|   NULL|    1|
|  45|4000.25|    1|
|  31|   NULL|    1|
|  31|2500.45|    1|
+----+-------+-----+

In [105]:
#corr
#Returns the Pearson correlation coefficient between two columns.

from pyspark.sql.functions import corr

df_corr = df.select(corr(col("age"), col("salary")))
df_corr.show()

+------------------+
| corr(age, salary)|
+------------------+
|0.5156484761493896|
+------------------+

In [109]:
#collect_list
#Returns all values from an aggregated group as a list.

from pyspark.sql.functions import collect_list

#df_collect_list = df.groupBy("age").agg(collect_list("salary").alias("salary_list"))
#df_collect_list.show()

from pyspark.sql.functions import collect_list

df_all = df.groupBy("age").agg(collect_list("name").alias("names")).show()
df_all

+---+---------------+
|age|          names|
+---+---------------+
| 34|   [Jane Smith]|
| 18|   [Jake White]|
| 23|     [John Doe]|
| 29|  [James Brown]|
| 31|[Madhav Mishra]|
| 45|   [Jill Black]|
+---+---------------+